# Shell utils
brew "lsd"
brew "bat"
brew "fzf"
brew "zoxide"
brew "ripgrep"

# Dev
brew "python@3.12"
brew "uv"
brew "poetry"
brew "modular"

brew "node"
brew "yarn"

brew "docker"
brew "lazydocker"

brew "neovim"
brew "tmux"

brew "cmake"
brew "ninja"

# Git
brew "gh"
brew "ghq"
brew "git"
brew "lazygit"

# Casks 
cask "karabiner-elements"
cask "ghidra"
