# Shell utils
brew "lsd"
brew "bat"
brew "fzf"
brew "zoxide"
brew "ripgrep"

# Dev
brew "python@3.12"
brew "uv"
brew "ruff"
brew "pyright"
brew "basedpyright"
brew "modular"

brew "node"
brew "yarn"

brew "docker"
brew "lazydocker"

brew "neovim"
brew "tmux"

brew "cmake"
brew "ninja"

brew "ghcup"
brew "zig"

# Git
brew "gh"
brew "ghq"
brew "git"
brew "lazygit"

# Devops
brew "azure-cli"
tap "hashicorp/tap"
brew "hashicorp/tap/terraform"

# Casks
cask "karabiner-elements"
cask "ghidra"
cask "iina"
